tutorials/multiCompressionFoam/pipeCompression/0/pointMotionUx.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngine addition to OpenFOAM v8
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.5.x-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue
        { 
            type        sine;
            frequency   1; // 1/endTime
            amplitude   2;
            start       0.15;
            level       0;

            // scale       1; /* OpenFOAM v7 or lower */
        }
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

    walls
    {
        type            slip;
    }
}

// ************************************************************************* //