tutorials/multiCompressionFoam/pipeCompression/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
/* Scheme of the block edges numbers
      7------6
     /|     /|
    4------5 |
    | |    | |
    | 3----|-2
    |/     |/
    0------1
*/

    /*00*/ (-30 -0.5 -0.5)
    /*01*/ (30 -0.5 -0.5)
    /*02*/ (30 0.5 -0.5)
    /*03*/ (-30 0.5 -0.5)
    /*04*/ (-30 -0.5 0.5)
    /*05*/ (30 -0.5 0.5)
    /*06*/ (30 0.5 0.5)
    /*07*/ (-30 0.5 0.5)
);

blocks
( 
    hex (0 1 2 3 4 5 6 7) (60 1 1) simpleGrading (1 1 1)
);

edges();

boundary
(
    walls
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 1 2 3)
            (4 5 6 7)
        );
    }

    inlet // rightWall
    {
        type wall;//patch;
        faces
        (
            (3 0 4 7)
        );
    }

    outlet // leftWall
    {
        type wall;//patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

// ************************************************************************* //
