tutorials/multiCompressionFoam/pipeCompression/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngine addition to OpenFOAM v8
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.5.x-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// limitU
// {
//     type            limitVelocity;
//     active          no;
//     selectionMode   all;
//     max             25;
// }

// limitT
// {
//     type            limitTemperature;
//     active          no;
//     selectionMode   all;
//     min             200;
//     max             400;
// }

//************************************************************************** //